structured array

In [3]:
import pandas as pd
import numpy as np

In [4]:
memberData = np.array([('Sanjeev',37,162.4),('Yingluck',45,137.8),('Emeka',28,153.2),('Amy',67,101.3)],dtype = [('Name','a15'),('Age','i4'),('Weight','f4')])

In [5]:
memberDF = pd.DataFrame(memberData)

In [6]:
memberDF.head(5)

          Name  Age      Weight
0   b'Sanjeev'   37  162.399994
1  b'Yingluck'   45  137.800003
2     b'Emeka'   28  153.199997
3       b'Amy'   67  101.300003

In [7]:
pd.DataFrame(memberData, index=['a','b','c','d'])

          Name  Age      Weight
a   b'Sanjeev'   37  162.399994
b  b'Yingluck'   45  137.800003
c     b'Emeka'   28  153.199997
d       b'Amy'   67  101.300003

In [8]:
pd.DataFrame(memberData, columns = ["Weight", "Name", "Age"])

       Weight         Name  Age
0  162.399994   b'Sanjeev'   37
1  137.800003  b'Yingluck'   45
2  153.199997     b'Emeka'   28
3  101.300003       b'Amy'   67

In [9]:
demographicData = [{"Age": 32, "Gender": "Male"}, {"Race": "Hispanic", "Gender": "Female", "Age": 26}]

In [10]:
demographicDF = pd.DataFrame(demographicData)

In [11]:
demographicDF.head(5)

   Age  Gender      Race
0   32    Male       NaN
1   26  Female  Hispanic

In [12]:
pd.DataFrame.from_records(memberData, index="Name")

             Age      Weight
Name
b'Sanjeev'    37  162.399994
b'Yingluck'   45  137.800003
b'Emeka'      28  153.199997
b'Amy'        67  101.300003

In [13]:
memberDF["Name"]

0     b'Sanjeev'
1    b'Yingluck'
2       b'Emeka'
3         b'Amy'
Name: Name, dtype: object

add new column

In [14]:
memberDF['Height'] = 60

In [15]:
memberDF

          Name  Age      Weight  Height
0   b'Sanjeev'   37  162.399994      60
1  b'Yingluck'   45  137.800003      60
2     b'Emeka'   28  153.199997      60
3       b'Amy'   67  101.300003      60

In [16]:
memberDF['Height2'] = [57, 62, 65, 59]

In [17]:
memberDF

          Name  Age      Weight  Height  Height2
0   b'Sanjeev'   37  162.399994      60       57
1  b'Yingluck'   45  137.800003      60       62
2     b'Emeka'   28  153.199997      60       65
3       b'Amy'   67  101.300003      60       59

In [18]:
memberDF.insert(1, "ID", ["S01", "S02", "S03", "S04"])
memberDF

          Name   ID  Age      Weight  Height  Height2
0   b'Sanjeev'  S01   37  162.399994      60       57
1  b'Yingluck'  S02   45  137.800003      60       62
2     b'Emeka'  S03   28  153.199997      60       65
3       b'Amy'  S04   67  101.300003      60       59

delete columns

In [19]:
del memberDF["Height"]
memberDF

          Name   ID  Age      Weight  Height2
0   b'Sanjeev'  S01   37  162.399994       57
1  b'Yingluck'  S02   45  137.800003       62
2     b'Emeka'  S03   28  153.199997       65
3       b'Amy'  S04   67  101.300003       59

In [20]:
height2 = memberDF.pop("Height2")
memberDF

          Name   ID  Age      Weight
0   b'Sanjeev'  S01   37  162.399994
1  b'Yingluck'  S02   45  137.800003
2     b'Emeka'  S03   28  153.199997
3       b'Amy'  S04   67  101.300003

alignment of DataFrames

In [21]:
ore1DF=pd.DataFrame(np.array([[20,35,25,20],[11,28,32,29]]),
            columns=['iron','magnesium','copper','silver'])
ore2DF=pd.DataFrame(np.array([[14,34,26,26],[33,19,25,23]]),
            columns=['iron','magnesium','gold','silver'])

In [22]:
ore1DF + ore2DF

   copper  gold  iron  magnesium  silver
0     NaN   NaN    34         69      46
1     NaN   NaN    44         47      52

In [23]:
ore1DF + pd.Series([25,25,25,25], index=['iron', 'magnesium', 'copper', 'silver'])

   iron  magnesium  copper  silver
0    45         60      50      45
1    36         53      57      54

In [24]:
ore1DF["add_iron_copper"] = ore1DF["iron"] + ore1DF["copper"]

In [25]:
logical_df1 = pd.DataFrame({'Col1' : [1, 0, 1], 'Col2' : [0, 1, 1] }, dtype=bool)
logical_df2 = pd.DataFrame({'Col1' : [1, 0, 0], 'Col2' : [0, 0, 1] }, dtype=bool)

In [26]:
logical_df1 | logical_df2

    Col1   Col2
0   True  False
1  False   True
2   True   True

In [27]:
np.sqrt(ore1DF)

       iron  magnesium    copper    silver  add_iron_copper
0  4.472136   5.916080  5.000000  4.472136         6.708204
1  3.316625   5.291503  5.656854  5.385165         6.557439